       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLOWORLD.

       PROCEDURE DIVISION.
           DISPLAY "HELLO WORLD".
           DISPLAY "LAWRENCE PANES".
           DISPLAY "MRS. ALETA FRABREGAS".
           STOP RUN.